{"pageProps":{"post":{"title":"Community Token-NEW Liquidity Mining Launched on Testnet","date":"2021-02-19","slug":"20210219en","content":"<p>NewSwap Community Token-NEW Trading Pair Liquidity Mining had been launched on the testnet, and related functions in computer end NewSwap and mobile end NewPay had been simultaneously launched. The incentive for the first phase of community token-NEW trading pair liquidity mining is 30 million NEW, and the mining will last for 30 days.</p>\n<h2>Operation Guide</h2>\n<h3>Use NewSwap On Computer</h3>\n<p>Open the testnet NewSwap, connect to the testnet wallet in NewMask, click \"Exchange\" and \"Pool\", add NEW-Community Token Liquidity.</p>\n<p>Open the testnet NewSwap, click Community Mining, select the mining pool, complete the community token-NEW liquidity token (LP Token) authorization and addition, then mining will start.</p>\n<h3>Use NewPay Mobile App</h3>\n<p>Open NewSwap on the NewPay Exchange page, and add NEW-community token liquidity to the pool.</p>\n<p>Click on the top banner \"community mining\" in \"Exhange\" page, select the mining pool, complete the community token-NEW liquidity token (LP Token) authorization and addition, and then mining will start.</p>\n<p>The testnet community token-NEW liquidity mining has been opened for applying, the link is <a href=\"https://testnet.newswap.org/apply-community-mining/\">https://testnet.newswap.org/apply-community-mining</a>. This testnet launching is for the preparation of the implementation of the NEP-40 community token-NEW liquidity mining on the mainnet. Encourage community token holders to expand their liquidity, and then apply to launch community token-NEW liquidity mining on the mainnet.</p>\n<hr>\n<p>Testnet NewSwap website: <a href=\"https://mining.testnet.newswap.org\">https://mining.testnet.newswap.org</a>.</p>\n<p>The testnet NewPay download URL: <a href=\"https://developer.newtonproject.org/dashboard/\">https://developer.newtonproject.org/dashboard/</a>.</p>\n"}},"__N_SSG":true}