{"pageProps":{"post":{"title":"NewSwap Transaction Mining Will Be Launch on Mainnet","date":"2021-02-10","slug":"20210210zh","content":"<p>NewSwap transaction mining will be launching on the mainnet at 8 o'clock (UTC+8) on February 11, 2021, Singapore time. Transaction mining portal have been launched on the transaction pages of NewPay and NewMask.</p>\n<p>The total amount of incentives for transaction mining is 10,000,000 NEW, which comes from the budget of approximately 260 million NEW allocated to mainstream asset trading pairs for liquidity mining in NEP-40. Transaction mining lasts for 7 days. Users will share 1,428,571.428 NEW rewards per day according to the ratio of the number of transactions to the total number of transactions within 24 hours. A snapshot of the number of transactions by users will be taken at 8:00 (UTC+8) after launching.</p>\n<h2>Operation Guide</h2>\n<h3>Use NewSwap On Computer</h3>\n<p>Open newswap.org and connect to Newton browser extension NewMask.</p>\n<p>Open transaction mining.</p>\n<p>Click \"Go to Exchange\" to complete exnchange of any trading pair in NewSwap, and you can share the daily incentive NEW according to the ratio of the number of transactions to the total number of transactions. The reward can be calculated at 8:00 (UTC+8) Singapore time the next day.</p>\n<h3>Use NewPay Mobile App</h3>\n<p>Open the top banner \"Transaction Mining\" on the NewPay transaction page, and click \"Confirm\" continuously to complete the connection with NewPay.</p>\n<p>Click \"Go to Exchange\" to complete exchange of any trading pair in NewSwap, and you can share the daily incentive NEW according to the ratio of the number of transactions to the total number of transactions. The reward can be calculated at 8:00 (UTC+8) Singapore time the next day.</p>\n<hr>\n<p>NewSwap website: <a href=\"https://www.newswap.org\">https://www.newswap.org</a>.</p>\n<p>NewPay download: <a href=\"https://www.newtonproject.org/newpay\">https://www.newtonproject.org/newpay</a>.</p>\n"}},"__N_SSG":true}